import React, { Component } from "react";
import styles from "./agreement.module.css";
import cx from "classnames";
import { Form, Button } from "react-bootstrap";
import { Redirect } from "react-router-dom";
import Swal from "sweetalert2";
import { Helmet } from "react-helmet";

export default class agreement extends Component {
  constructor() {
    super();
    this.state = {
      path: "",
      pass: false,
    };
  }

  render() {
    if (this.state.path !== "" && this.state.pass === true) {
      return <Redirect to={this.state.path} />;
    }
    return (
      <div className={styles.container}>
        <Helmet>
          <title>ลงทะเบียนกิจกรรม/กิจการ/สถานประกอบการโครงการไทยชนะ</title>
        </Helmet>
        {/* Blue bar */}
        <div className={styles.bar}></div>

        {/* HEADER */}
        <div className="px-3 py-3 pt-md-5 mx-auto text-center">
          <h1
            className={cx("display-6", styles.textMuted)}
            style={{ color: "#2a4365" }}
          >
            ข้อตกลงและความยินยอม
          </h1>
          <p
            className={cx("lead mx-auto", styles.textColor)}
            style={{ maxWidth: 700 }}
          >
            ในการดำเนินมาตรการป้องกันโรคตามที่ทางราชการกำหนดเพื่อป้องกันการแพร่ระบาดของโรคโควิด
            19
          </p>
        </div>

        {/* TERMS AND AGREEMENT */}
        <div className="container">
          <div className="card border-0 shadow mb-5">
            <div className="card-body">
              <ol className="p-0 pl-lg-4">
                <li>
                  <b>คำนิยาม</b>
                  <ol className="p-0 pl-lg-4">
                    <li className={styles.gg}>
                      <b>“หน่วยงานเจ้าของมาตรการฯ”</b> หมายความถึง
                      กระทรวงสาธารณสุข หน่วยงานภายใต้สังกัดกระทรวงสาธารณสุข
                      และหน่วยงานอื่นใดที่ได้รับมอบหมายจากกระทรวงสาธารณสุข
                    </li>
                    <li className={styles.gg}>
                      <b>“ผู้ประกอบการ”</b> หมายความถึง บุคคลธรรมดา นิติบุคคล
                      หน่วยงานราชการ และหน่วยงานอื่นใด ซึ่งเป็นผู้ประกอบกิจการ
                      หรือดำเนินกิจการหรือกิจกรรม ณ สถานที่ใด ๆ
                      ภายใต้มาตรการป้องกันโรคตามที่ราชการกำหนดเพื่อป้องกันการแพร่ระบาดของโรคโควิด
                      19 ทั้งนี้ ผู้ประกอบการ ให้หมายความรวมถึง ตัวแทน พนักงาน
                      ลูกจ้าง เจ้าหน้าที่ของผู้ประกอบการดังกล่าวด้วย
                    </li>
                    <li className={styles.gg}>
                      <b>“หน่วยงานเจ้าของมาตรการฯ”</b> หมายความถึง บุคคลใด ๆ
                      ที่ประสงค์จะเข้ามาภายในพื้นที่ของผู้ประกอบการ หรือ
                      ผู้ที่ประสงค์จะเข้าร่วมกิจกรรมใด ๆ
                      ภายในพื้นที่ของผู้ประกอบการ
                    </li>
                    <li className={styles.gg}>
                      <b>“หน่วยงานเจ้าของมาตรการฯ”</b> หมายความถึง
                      มาตรการป้องกันโรคตามที่ราชการกำหนดเพื่อป้องกันการแพร่ระบาดของโรคโควิด
                      19
                    </li>
                  </ol>
                </li>
                <li>
                  <b>
                    เมื่อยินยอมตามข้อตกลงฉบับนี้แล้ว
                    ผู้ประกอบการต้องปฏิบัติตามที่มาตรการฯ กำหนดอย่างเคร่งครัด
                  </b>
                  <ol className="p-0 pl-lg-4"></ol>
                </li>
                <li>
                  <b>
                    ข้อตกลงและความยินยอมของผู้ประกอบการที่ลงทะเบียนเข้าร่วมมาตรการฯ
                  </b>
                  <ol className="p-0 pl-lg-4">
                    <li>
                      ข้าพเจ้ายินยอมให้หน่วยงานเจ้าของมาตรการฯ เก็บ รวบรวม
                      และใช้ข้อมูลส่วนบุคคลที่ข้าพเจ้าได้ลงทะเบียนไว้
                      เพื่อการติดต่อในการดำเนินการตามมาตรการฯ
                    </li>
                    <li>
                      ข้าพเจ้าตกลงยินยอมให้หน่วยงานเจ้าของมาตรการฯ เก็บ รวบรวม
                      ใช้ และเปิดเผยข้อมูลใด ๆ
                      ซึ่งอาจรวมถึงข้อมูลส่วนบุคคลที่ข้าพเจ้าได้ให้ไว้
                      เพื่อประโยชน์ในการดำเนินการตามมาตรการฯ
                      เพื่อประโยชน์ในการตรวจสอบ กำหนดนโยบาย
                      และดำเนินการอื่นใดเพื่อป้องกันและควบคุมการแพร่ระบาดของโรคโควิด
                      19 และโรคติดต่ออื่น ๆ
                      รวมถึงเพื่อประโยชน์สาธารณะทั้งในระหว่างและภายหลังที่มาตรการฯ
                      มีผลใช้บังคับ
                    </li>
                    <li>
                      ข้าพเจ้ารับทราบว่าการนำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลอันเป็นเท็จเป็นการกระทำความผิดตามกฎหมาย
                      และอาจมีโทษทางอาญา
                    </li>
                    <li>
                      ข้าพเจ้ายินยอมให้ผู้ใช้บริการและบุคคลทั่วไปประเมินการปฏิบัติตามมาตรการฯ
                      ของข้าพเจ้าและแสดงผลให้ผู้ใช้บริการและบุคคลทั่วไปทราบ
                      เพื่อประโยชน์ในการป้องกันและควบคุมการแพร่ระบาดของโรคโควิด
                      19 และโรคติดต่ออื่น ๆ
                      โดยข้าพเจ้าจะไม่เรียกร้องค่าเสียหายใด ๆ
                      อันเกิดหรืออาจเกิดขึ้นจากผลการประเมินตามมาตรการฯ ดังกล่าว
                    </li>
                    <li>
                      ข้าพเจ้าได้อ่าน เข้าใจ
                      และรับทราบถึงข้อปฏิบัติตามเงื่อนไขของมาตรการฯ
                      ดังกล่าวข้างต้น
                      หากข้าพเจ้าไม่ปฏิบัติตามเงื่อนไขของมาตรการฯ
                      ข้าพเจ้ายินยอมให้หน่วยงานที่เกี่ยวข้องดำเนินการหรือออกคำสั่งตามกฎหมายว่าด้วยโรคติดต่อ
                      กฎหมายว่าด้วยการสาธารณสุข หรือกฎหมายอื่นใดที่เกี่ยวข้อง
                      แล้วแต่กรณี ทั้งนี้
                      เพื่อแสดงถึงความยินยอมข้าพเจ้าได้ทำเครื่องหมายไว้ในช่องตกลงยินยอมแล้ว
                    </li>
                  </ol>
                </li>
              </ol>
              <p className="p-0 pl-lg-4 m-0">
                <b style={{ fontWeight: "bolder" }}>
                  ข้าพเจ้าขอยืนยันและรับรองว่า ข้าพเจ้าเป็นผู้ประกอบการ
                  หรือเป็นผู้ที่ประสงค์จะเข้าร่วมมาตรการฯ ในนามของผู้ประกอบการ
                  และข้อมูลใด ๆ ที่ข้าพเจ้าได้ลงทะเบียนในการเข้าร่วมมาตรการฯ ไว้
                  (ซึ่งรวมถึงข้อมูลส่วนบุคคล) เป็นข้อมูลที่ถูกต้อง สมบูรณ์
                  และเป็นปัจจุบันทุกประการ โดยข้าพเจ้าจะดำเนินการตามที่กฎหมาย
                  และมาตรการฯ
                  กำหนดเพื่อให้บรรลุวัตถุประสงค์ภายใต้ข้อตกลงและความยินยอมนี้
                  ทั้งนี้ หากข้าพเจ้าผิดคำรับรองดังกล่าว
                  ข้าพเจ้ายินยอมให้หน่วยงานที่เกี่ยวข้องดำเนินการหรือออกคำสั่งตามกฎหมายว่าด้วยโรคติดต่อ
                  กฎหมายว่าด้วยการสาธารณสุข หรือกฎหมายอื่นใดที่เกี่ยวข้อง
                  ซึ่งอาจทำให้ข้าพเจ้าต้องรับผิดตามกฎหมาย
                </b>
              </p>
              <div
                className="py-3 px-md-5"
                style={{ maxWidth: 768, margin: "0 auto" }}
              >
                <div className="d-flex justify-content-center mb-3 ng-star-inserted">
                  <Form.Check
                    custom
                    inline
                    label="ข้าพเจ้าได้อ่านและตกลงยินยอมตามรายละเอียดข้อตกลงและความยินยอมข้างต้น"
                    type="checkbox"
                    id="custom-inline-checkbox-1"
                    onClick={(e) => {
                      if (this.state.pass === false) {
                        this.setState({
                          pass: true,
                        });
                      } else {
                        this.setState({
                          pass: false,
                        });
                      }
                    }}
                  />
                </div>
                <a>
                  <Button
                    variant="primary"
                    className="btn btn-block btn-lg"
                    style={{ backgroundColor: "#235e95" }}
                    onClick={() => {
                      if (this.state.pass === false) {
                        Swal.fire({
                          text: "กรุณาคลิกในช่องสี่เหลี่ยม ก่อนกดยืนยัน",
                          icon: "warning",
                          confirmButtonColor: "#2e78be",
                          confirmButtonText: "ตกลง",
                        });
                      } else {
                        this.setState({
                          path: "/register/detail",
                        });
                      }
                    }}
                  >
                    {" "}
                    ยืนยัน{" "}
                  </Button>
                </a>
                <a
                  href="https://www.xn--b3czh8ayeuf.com/"
                  className="btn btn-block btn-lg btn-link mt-2"
                  style={{ color: "#2d78be", fontWeight: "bold" }}
                >
                  {" "}
                  กลับหน้าหลัก{" "}
                </a>
                <p className="m-0 text-center">
                  <small className="text-danger text-center">
                    <strong>
                      **หมายเหตุ ผู้ลงทะเบียนรับทราบว่า
                      หากผู้ลงทะเบียนไม่ตกลงและยอมรับตามข้อตกลง
                      <br />
                      และเงื่อนไขข้างต้นจะไม่สามารถลงทะเบียนได้
                    </strong>
                  </small>
                </p>
              </div>
            </div>
          </div>
        </div>

        <p
          className={cx("lead mt-5", styles.textColor)}
          style={{ textAlign: "center" }}
        >
          Cyberpunk © 2077
        </p>
      </div>
    );
  }
}
