import React, { Component } from "react";
import styles from "./agreement.module.css";
import cx from "classnames";
import { Form, Container, Row, Col, Button } from "react-bootstrap";

export default class agreement extends Component {
    render() {
        return (
            <div className={styles.container}>

                {/* Blue bar */}
                <div className={styles.bar}></div>

                {/* HEADER */}
                <div className="px-3 py-3 pt-md-5 mx-auto text-center">
                    <h1
                        className={cx("display-6", styles.textMuted)}
                        style={{ color: "#2a4365" }}
                    >
                        ข้อตกลงและความยินยอม
                    </h1>
                    <p
                        className={cx("lead mx-auto", styles.textColor)}
                        style={{ maxWidth: 700 }}
                    >
                        ในการดำเนินมาตรการป้องกันโรคตามที่ทางราชการกำหนดเพื่อป้องกันการแพร่ระบาดของโรคโควิด 19
                    </p>
                </div>

                {/* TERMS AND AGREEMENT */}
                <Container>
                    <Row>
                        <Col></Col>
                        <Col xs={11} className={cx("px-3 py-3 pt-md-5 mx-auto", styles.dropShadow)}>
                            <p>
                                <span style={{ fontWeight: "bolder" }}>1 คำนิยาม </span><br />
                                <span>
                                    <span style={{ fontWeight: "bolder" }}>1.1 “หน่วยงานเจ้าของมาตรการฯ”</span> หมายความถึง กระทรวงสาธารณสุข หน่วยงานภายใต้สังกัดกระทรวงสาธารณสุข และหน่วยงานอื่นใดที่ได้รับมอบหมายจากกระทรวงสาธารณสุข<br />
                                    <span style={{ fontWeight: "bolder" }}>1.2“ผู้ประกอบการ”</span> หมายความถึง บุคคลธรรมดา นิติบุคคล หน่วยงานราชการ และหน่วยงานอื่นใด ซึ่งเป็นผู้ประกอบกิจการ หรือดำเนินกิจการหรือกิจกรรม ณ สถานที่ใด ๆ ภายใต้มาตรการป้องกันโรคตามที่ราชการกำหนดเพื่อป้องกันการแพร่ระบาดของโรคโควิด 19 ทั้งนี้ ผู้ประกอบการ ให้หมายความรวมถึง ตัวแทน พนักงาน ลูกจ้าง เจ้าหน้าที่ของผู้ประกอบการดังกล่าวด้วย<br />
                                    <span style={{ fontWeight: "bolder" }}>1.3"ผู้ใช้บริการ"</span> หมายความถึง บุคคลใด ๆ ที่ประสงค์จะเข้ามาภายในพื้นที่ของผู้ประกอบการ หรือ ผู้ที่ประสงค์จะเข้าร่วมกิจกรรมใด ๆ ภายในพื้นที่ของผู้ประกอบการ<br />
                                    <span style={{ fontWeight: "bolder" }}>1.4“มาตรการฯ”</span> หมายความถึง มาตรการป้องกันโรคตามที่ราชการกำหนดเพื่อป้องกันการแพร่ระบาดของโรคโควิด 19<br />
                                </span>
                                <span style={{ fontWeight: "bolder" }}>2 เมื่อยินยอมตามข้อตกลงฉบับนี้แล้ว ผู้ประกอบการต้องปฏิบัติตามที่มาตรการฯ กำหนดอย่างเคร่งครัด</span><br />
                                <span style={{ fontWeight: "bolder" }}>3 ข้อตกลงและความยินยอมของผู้ประกอบการที่ลงทะเบียนเข้าร่วมมาตรการฯ</span><br />
                                <span>
                                    3.1 ข้าพเจ้ายินยอมให้หน่วยงานเจ้าของมาตรการฯ เก็บ รวบรวม และใช้ข้อมูลส่วนบุคคลที่ข้าพเจ้าได้ลงทะเบียนไว้ เพื่อการติดต่อในการดำเนินการตามมาตรการฯ<br />
                                    3.2 ข้าพเจ้าตกลงยินยอมให้หน่วยงานเจ้าของมาตรการฯ เก็บ รวบรวม ใช้ และเปิดเผยข้อมูลใด ๆ ซึ่งอาจรวมถึงข้อมูลส่วนบุคคลที่ข้าพเจ้าได้ให้ไว้ เพื่อประโยชน์ในการดำเนินการตามมาตรการฯ เพื่อประโยชน์ในการตรวจสอบ กำหนดนโยบาย และดำเนินการอื่นใดเพื่อป้องกันและควบคุมการแพร่ระบาดของโรคโควิด 19 และโรคติดต่ออื่น ๆ รวมถึงเพื่อประโยชน์สาธารณะทั้งในระหว่างและภายหลังที่มาตรการฯ มีผลใช้บังคับ<br />
                                    3.3 ข้าพเจ้ารับทราบว่าการนำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลอันเป็นเท็จเป็นการกระทำความผิดตามกฎหมาย และอาจมีโทษทางอาญา<br />
                                    3.4 ข้าพเจ้ายินยอมให้ผู้ใช้บริการและบุคคลทั่วไปประเมินการปฏิบัติตามมาตรการฯ ของข้าพเจ้าและแสดงผลให้ผู้ใช้บริการและบุคคลทั่วไปทราบ เพื่อประโยชน์ในการป้องกันและควบคุมการแพร่ระบาดของโรคโควิด 19 และโรคติดต่ออื่น ๆ โดยข้าพเจ้าจะไม่เรียกร้องค่าเสียหายใด ๆ อันเกิดหรืออาจเกิดขึ้นจากผลการประเมินตามมาตรการฯ ดังกล่าว<br />
                                    3.5 ข้าพเจ้าได้อ่าน เข้าใจ และรับทราบถึงข้อปฏิบัติตามเงื่อนไขของมาตรการฯ ดังกล่าวข้างต้น หากข้าพเจ้าไม่ปฏิบัติตามเงื่อนไขของมาตรการฯ ข้าพเจ้ายินยอมให้หน่วยงานที่เกี่ยวข้องดำเนินการหรือออกคำสั่งตามกฎหมายว่าด้วยโรคติดต่อ กฎหมายว่าด้วยการสาธารณสุข หรือกฎหมายอื่นใดที่เกี่ยวข้อง แล้วแต่กรณี ทั้งนี้ เพื่อแสดงถึงความยินยอมข้าพเจ้าได้ทำเครื่องหมายไว้ในช่องตกลงยินยอมแล้ว<br />
                                </span>
                                <span style={{ fontWeight: "bolder" }}>ข้าพเจ้าขอยืนยันและรับรองว่า ข้าพเจ้าเป็นผู้ประกอบการ หรือเป็นผู้ที่ประสงค์จะเข้าร่วมมาตรการฯ ในนามของผู้ประกอบการ และข้อมูลใด ๆ ที่ข้าพเจ้าได้ลงทะเบียนในการเข้าร่วมมาตรการฯ ไว้ (ซึ่งรวมถึงข้อมูลส่วนบุคคล) เป็นข้อมูลที่ถูกต้อง สมบูรณ์ และเป็นปัจจุบันทุกประการ โดยข้าพเจ้าจะดำเนินการตามที่กฎหมาย และมาตรการฯ กำหนดเพื่อให้บรรลุวัตถุประสงค์ภายใต้ข้อตกลงและความยินยอมนี้ ทั้งนี้ หากข้าพเจ้าผิดคำรับรองดังกล่าว ข้าพเจ้ายินยอมให้หน่วยงานที่เกี่ยวข้องดำเนินการหรือออกคำสั่งตามกฎหมายว่าด้วยโรคติดต่อ กฎหมายว่าด้วยการสาธารณสุข หรือกฎหมายอื่นใดที่เกี่ยวข้อง ซึ่งอาจทำให้ข้าพเจ้าต้องรับผิดตามกฎหมาย</span>
                            </p>
                            <Form className="mx-auto text-center">
                                <input type="checkbox" />
                                <label style={{ textIndent: 10 }}>ข้าพเจ้าได้อ่าน และตกลงยินยอมตามรายละเอียดข้อตกลงและความยินยอมข้างต้น</label>
                            </Form>
                            <Container>
                                <Row>
                                    <Col></Col>
                                    <Col xs={9}>
                                        {/* TODO: LINK TO DETAIL PAGE */}
                                        <Button variant="primary" block>ยืนยัน</Button> 
                                    </Col>
                                    <Col></Col>
                                </Row>
                            </Container>
                            {/* TODO: LINK TO MAIN PAGE */}
                            <a href="#">
                                <p
                                    className={cx("lead mx-auto mt-3", styles.textColor)}
                                    style={{ maxWidth: 700, fontWeight: "bold", textAlign: "center"}}
                                >
                                    กลับหน้าหลัก
                                </p>
                            </a>
                            <p className="mt-3" style={{ textAlign: "center", color: "red", fontWeight: "bold" }}>
                                **หมายเหตุ ผู้ลงทะเบียนรับทราบว่า หากผู้ลงทะเบียนไม่ตกลงและยอมรับตามข้อตกลง <br />
                                และเงื่อนไขข้างต้นจะไม่สามารถลงทะเบียนได้
                            </p>
                        </Col>
                        <Col></Col>
                    </Row>
                </Container>

                <p className={cx("lead mt-5", styles.textColor)} style={{textAlign: "center"}}>
                    Copyright © 2020
                </p>

            </div>
        )
    }
}